Not sure if it's exactly the same case, but when we try to upgrade a rule present in a ruleset, seems that all rule IDs are going to change. As example:
```
  # cloudflare_ruleset.test will be updated in-place
  ~ resource "cloudflare_ruleset" "managed_rules" {
        id          = "[redacted]"
        name        = "[redacted]"
        # (4 unchanged attributes hidden)

      ~ rules {
          ~ id           = "ecf3ce8914ad45d982454d36c9d3f5a4" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "7" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "03950e57a3f5460ca068521f091f902b" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "7" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "19bb0e2cf48b4e61b0762a224ab3789d" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "7" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "33410ab1ff394b65ac66107a076aec4d" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "7" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "b0920b97bb6647cb9567b77309e06987" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "2" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "f251f3c522734ec68ece824d48dda01b" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "7" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "1ed6a4ebc27b4801a54aa8bbb70b5ce6" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "7" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ expression   = "[redacted]" -> "[redacted-change]"
          ~ id           = "72aab41300674161a3ef7ec5864ab5ef" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "7" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "c96e1fc906814a3eb306c925782a4e27" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "1" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "0464152c4c874972a6141dfd97b584ff" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "1" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ rules {
          ~ id           = "8f6790c8cc4e4deb9e773e1804d3d817" -> (known after apply)
          + last_updated = (known after apply)
          ~ version      = "3" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ action_parameters {
              + version = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

which seems a regression of #2172 